zz2286/STM32_learn/Demos/F103C8T6_std-lib_demo/08_GPIO_RCC_EXTI_SysTick_USART_DMA_Software_SPI_OLED/User/bsp/bsp_oled.h
#ifndef __BSP_OLED_H
#define __BSP_OLED_H 

#include "stm32f10x.h"
#include "stdlib.h"	

/* -----------------OLED端口定义---------------- */
// OLED_CS, SPI_NSS, PA4
#define OLED_CS_Clr()  GPIO_ResetBits(GPIOA,GPIO_Pin_4)
#define OLED_CS_Set()  GPIO_SetBits(GPIOA,GPIO_Pin_4)

// OLED_D0_SCL, SPI_SCK, PA5
#define OLED_SCLK_Clr() GPIO_ResetBits(GPIOA,GPIO_Pin_5)
#define OLED_SCLK_Set() GPIO_SetBits(GPIOA,GPIO_Pin_5)

// OLED_D1_SDA, SPI_MOSI, PA7
#define OLED_SDIN_Clr() GPIO_ResetBits(GPIOA,GPIO_Pin_7)
#define OLED_SDIN_Set() GPIO_SetBits(GPIOA,GPIO_Pin_7)

// OLED_RES, PB0
#define OLED_RST_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_0)
#define OLED_RST_Set() GPIO_SetBits(GPIOB,GPIO_Pin_0)

// OLED_DC, PB1
#define OLED_DC_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_1)
#define OLED_DC_Set() GPIO_SetBits(GPIOB,GPIO_Pin_1)


#define OLED_CMD  0	//写命令
#define OLED_DATA 1	//写数据
#define u8 unsigned char
#define u32 unsigned int

void OLED_ClearPoint(u8 x,u8 y);
void OLED_ColorTurn(u8 i);
void OLED_DisplayTurn(u8 i);
void OLED_WR_Byte(u8 dat,u8 cmd);
void OLED_DisPlay_On(void);
void OLED_DisPlay_Off(void);
void OLED_Refresh(void);
void OLED_Clear(void);
void OLED_DrawPoint(u8 x,u8 y);
void OLED_DrawLine(u8 x1,u8 y1,u8 x2,u8 y2);
void OLED_DrawCircle(u8 x,u8 y,u8 r);
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 size1);
void OLED_ShowString(u8 x,u8 y,char *chr,u8 size1);
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size1);
void OLED_ShowChinese(u8 x,u8 y,u8 num,u8 size1);
void OLED_ScrollDisplay(u8 num,u8 space);
void OLED_WR_BP(u8 x,u8 y);
void OLED_ShowPicture(u8 x0,u8 y0,u8 x1,u8 y1,u8 BMP[]);
void OLED_Init(void);

void OLED_Demo();
void OLED_Process_Loop();

#endif /* __BSP_OLED_H */